Documents/Изготовление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Изготовление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Изделия</xr:Item>
				<xr:Item>AccumulationRegister.Сырье</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Каста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изделие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Изделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Изделия</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Изделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Сырье.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Сырье</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сырье</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СоставИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставИзделия</Name>
			<Comment>Рецептура: какое сырьё и сколько на единицу изделия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сырье</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Изготовление/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = 0;
	
	Для Каждого СуммаИзделия Из Изделие Цикл
		Сумма = Сумма + (СуммаИзделия.Цена * СуммаИзделия.Количество);
	КонецЦикла;
	
КонецПроцедуры


// Обработка проведения документа "Изготовление".
// Изготовление = расход сырья (регистр "Сырье") + приход готовой продукции (регистр "Изделия").
//
// КАК РАБОТАЕТ ЗАПРОС:
// 1) Первый запрос (ПОМЕСТИТЬ втДанныеДокумента): читает табличную часть документа
//    "Изделие", фильтрует по текущей ссылке (&Ссылка), группирует по полю Вид (изделие).
//    В итоге по каждому виду изделия получаем: одну строку с суммарным Количество,
//    Сумма = сумма(Количество * Цена) по всем строкам этого вида, Представление для сообщений.
// 2) Второй запрос: просто выбирает из временной таблицы все строки — по одной на каждый
//    вид изделия с итоговыми Количество и Сумма. Эти данные используются в цикле для
//    формирования движений прихода (одно движение на каждый вид с суммарным количеством и суммой).
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Проверка: проводим только если заполнена хотя бы одна табличная часть — "Изделие" или "Сырье"
	Если Изделие.Количество() = 0 Тогда
		Сообщить("Родной, заполните табличную часть «Изделие» или «Сырье».");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Включаем запись движений: приход по "Изделия", расход по "Сырье" (авторасход по рецептуре)
	Движения.Изделия.Записывать = Истина;
	Движения.Сырье.Записывать = Истина;
	
	// Расход сырья по рецептуре — по образцу Потребление: остатки на момент документа, проверка достаточности, стоимость по средней
	ЗапросРецепт = Новый Запрос;
	ЗапросРецепт.Текст =
	"ВЫБРАТЬ
	|	ИзготовлениеИзделие.Вид КАК Изделие,
	|	СУММА(ИзготовлениеИзделие.Количество) КАК КоличествоДокумента
	|ПОМЕСТИТЬ втИзделияДокумента
	|ИЗ
	|	Документ.Изготовление.Изделие КАК ИзготовлениеИзделие
	|ГДЕ
	|	ИзготовлениеИзделие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзготовлениеИзделие.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставИзделия.Сырье КАК Сырье,
	|	СУММА(СоставИзделия.КоличествоНаЕдиницу * втИзделияДокумента.КоличествоДокумента) КАК КоличествоРасхода
	|ПОМЕСТИТЬ втДанныеСырье
	|ИЗ
	|	РегистрСведений.СоставИзделия КАК СоставИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИзделияДокумента КАК втИзделияДокумента
	|		ПО СоставИзделия.Изделие = втИзделияДокумента.Изделие
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставИзделия.Сырье
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСырье.Сырье КАК Сырье,
	|	втДанныеСырье.КоличествоРасхода КАК Количество,
	|	втДанныеСырье.Сырье.Представление КАК СырьеПредставление,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СырьеОстатки.КоличествоОстаток, 0) >= втДанныеСырье.КоличествоРасхода
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДостаточноОстатков,
	|	ВЫБОР
	|		КОГДА втДанныеСырье.КоличествоРасхода = ЕСТЬNULL(СырьеОстатки.КоличествоОстаток, 0)
	|			ТОГДА ЕСТЬNULL(СырьеОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(СырьеОстатки.КоличествоОстаток, 0) = 0
	|					ТОГДА 0
	|				ИНАЧЕ ЕСТЬNULL(СырьеОстатки.СуммаОстаток, 0) / ЕСТЬNULL(СырьеОстатки.КоличествоОстаток, 0) * втДанныеСырье.КоличествоРасхода
	|			КОНЕЦ
	|	КОНЕЦ КАК Стоимость
	|ИЗ
	|	втДанныеСырье КАК втДанныеСырье
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Сырье.Остатки(
	|				&МоментВремени,
	|				Сырье В
	|					(ВЫБРАТЬ
	|						втДанныеСырье.Сырье КАК Сырье
	|					ИЗ
	|						втДанныеСырье КАК втДанныеСырье)) КАК СырьеОстатки
	|		ПО втДанныеСырье.Сырье = СырьеОстатки.Сырье";
	
	ЗапросРецепт.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросРецепт.УстановитьПараметр("МоментВремени", МоментВремени());
	РезультатСырье = ЗапросРецепт.Выполнить();
	ВыборкаСырье = РезультатСырье.Выбрать();
	
	// Первый проход: проверка достаточности остатков сырья
	Пока ВыборкаСырье.Следующий() Цикл
		Если НЕ ВыборкаСырье.ДостаточноОстатков Тогда
			Сообщить("Родной, остатков сырья недостаточно для проведения: " + ВыборкаСырье.СырьеПредставление);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Второй проход: формирование движений расхода по сырью (стоимость по средней из остатков)
	Если НЕ Отказ Тогда
		ВыборкаСырье = РезультатСырье.Выбрать();
		Пока ВыборкаСырье.Следующий() Цикл
			ДвижениеСырье = Движения.Сырье.Добавить();
			ДвижениеСырье.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеСырье.Период = Дата;
			ДвижениеСырье.Сырье = ВыборкаСырье.Сырье;
			ДвижениеСырье.Количество = ВыборкаСырье.Количество;
			ДвижениеСырье.Сумма = ВыборкаСырье.Стоимость;
		КонецЦикла;
	КонецЕсли;
	
	// Запрос в два шага:
	// 1) Временная таблица втДанныеДокумента — по документу группируем по виду изделия:
	//    получаем изделие (Вид), суммарное количество, сумма (количество * цена), представление для сообщений
	// 2) Итоговый выборка из ВТ (для прихода остатки не проверяем — добавляем готовую продукцию)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзготовлениеИзделие.Вид КАК Изделие,
	|	СУММА(ИзготовлениеИзделие.Количество) КАК Количество,
	|	СУММА(ИзготовлениеИзделие.Количество * ИзготовлениеИзделие.Цена) КАК Сумма
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.Изготовление.Изделие КАК ИзготовлениеИзделие
	|ГДЕ
	|	ИзготовлениеИзделие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзготовлениеИзделие.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.Изделие КАК Изделие,
	|	втДанныеДокумента.Количество КАК Количество,
	|	втДанныеДокумента.Сумма КАК Сумма
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// Формирование движений прихода по регистру "Изделия" (готовая продукция)
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.Изделия.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Изделия = ВыборкаДетальныеЗаписи.Изделие;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецПроцедуры
